weifengdq/embedded/tc397/tc397_uart_lettershell/Libraries/iLLD/TC3xx/Tricore/_PinMap/TC39xB/IfxGtm_PinMap_TC39xB_LFBGA516.h
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_1_P33_1_IN;  /**< \brief IfxGtm_TIM3_1_P33_1_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_2_P00_3_IN;  /**< \brief IfxGtm_TIM3_2_P00_3_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_2_P00_7_IN;  /**< \brief IfxGtm_TIM3_2_P00_7_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_2_P02_8_IN;  /**< \brief IfxGtm_TIM3_2_P02_8_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_2_P11_3_IN;  /**< \brief IfxGtm_TIM3_2_P11_3_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_2_P13_14_IN;  /**< \brief IfxGtm_TIM3_2_P13_14_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_2_P14_14_IN;  /**< \brief IfxGtm_TIM3_2_P14_14_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_2_P14_8_IN;  /**< \brief IfxGtm_TIM3_2_P14_8_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_2_P20_14_IN;  /**< \brief IfxGtm_TIM3_2_P20_14_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_2_P22_6_IN;  /**< \brief IfxGtm_TIM3_2_P22_6_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_2_P25_2_IN;  /**< \brief IfxGtm_TIM3_2_P25_2_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_2_P32_0_IN;  /**< \brief IfxGtm_TIM3_2_P32_0_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_2_P33_2_IN;  /**< \brief IfxGtm_TIM3_2_P33_2_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_3_P00_4_IN;  /**< \brief IfxGtm_TIM3_3_P00_4_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_3_P00_8_IN;  /**< \brief IfxGtm_TIM3_3_P00_8_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_3_P02_9_IN;  /**< \brief IfxGtm_TIM3_3_P02_9_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_3_P11_6_IN;  /**< \brief IfxGtm_TIM3_3_P11_6_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_3_P13_4_IN;  /**< \brief IfxGtm_TIM3_3_P13_4_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_3_P14_13_IN;  /**< \brief IfxGtm_TIM3_3_P14_13_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_3_P14_9_IN;  /**< \brief IfxGtm_TIM3_3_P14_9_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_3_P15_0_IN;  /**< \brief IfxGtm_TIM3_3_P15_0_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_3_P20_1_IN;  /**< \brief IfxGtm_TIM3_3_P20_1_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_3_P22_7_IN;  /**< \brief IfxGtm_TIM3_3_P22_7_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_3_P25_3_IN;  /**< \brief IfxGtm_TIM3_3_P25_3_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_3_P32_1_IN;  /**< \brief IfxGtm_TIM3_3_P32_1_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_3_P33_3_IN;  /**< \brief IfxGtm_TIM3_3_P33_3_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_4_P00_5_IN;  /**< \brief IfxGtm_TIM3_4_P00_5_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_4_P02_10_IN;  /**< \brief IfxGtm_TIM3_4_P02_10_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_4_P11_9_IN;  /**< \brief IfxGtm_TIM3_4_P11_9_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_4_P13_5_IN;  /**< \brief IfxGtm_TIM3_4_P13_5_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_4_P14_10_IN;  /**< \brief IfxGtm_TIM3_4_P14_10_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_4_P14_12_IN;  /**< \brief IfxGtm_TIM3_4_P14_12_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_4_P15_1_IN;  /**< \brief IfxGtm_TIM3_4_P15_1_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_4_P20_3_IN;  /**< \brief IfxGtm_TIM3_4_P20_3_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_4_P21_0_IN;  /**< \brief IfxGtm_TIM3_4_P21_0_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_4_P22_8_IN;  /**< \brief IfxGtm_TIM3_4_P22_8_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_4_P25_4_IN;  /**< \brief IfxGtm_TIM3_4_P25_4_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_4_P34_1_IN;  /**< \brief IfxGtm_TIM3_4_P34_1_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_5_P00_6_IN;  /**< \brief IfxGtm_TIM3_5_P00_6_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_5_P02_11_IN;  /**< \brief IfxGtm_TIM3_5_P02_11_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_5_P11_10_IN;  /**< \brief IfxGtm_TIM3_5_P11_10_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_5_P13_0_IN;  /**< \brief IfxGtm_TIM3_5_P13_0_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_5_P13_13_IN;  /**< \brief IfxGtm_TIM3_5_P13_13_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_5_P13_6_IN;  /**< \brief IfxGtm_TIM3_5_P13_6_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_5_P15_2_IN;  /**< \brief IfxGtm_TIM3_5_P15_2_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_5_P20_9_IN;  /**< \brief IfxGtm_TIM3_5_P20_9_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_5_P21_1_IN;  /**< \brief IfxGtm_TIM3_5_P21_1_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_5_P22_9_IN;  /**< \brief IfxGtm_TIM3_5_P22_9_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_5_P25_5_IN;  /**< \brief IfxGtm_TIM3_5_P25_5_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_5_P32_5_IN;  /**< \brief IfxGtm_TIM3_5_P32_5_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_5_P34_2_IN;  /**< \brief IfxGtm_TIM3_5_P34_2_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_6_P00_7_IN;  /**< \brief IfxGtm_TIM3_6_P00_7_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_6_P02_12_IN;  /**< \brief IfxGtm_TIM3_6_P02_12_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_6_P11_11_IN;  /**< \brief IfxGtm_TIM3_6_P11_11_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_6_P13_1_IN;  /**< \brief IfxGtm_TIM3_6_P13_1_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_6_P13_7_IN;  /**< \brief IfxGtm_TIM3_6_P13_7_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_6_P14_15_IN;  /**< \brief IfxGtm_TIM3_6_P14_15_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_6_P15_3_IN;  /**< \brief IfxGtm_TIM3_6_P15_3_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_6_P20_10_IN;  /**< \brief IfxGtm_TIM3_6_P20_10_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_6_P20_6_IN;  /**< \brief IfxGtm_TIM3_6_P20_6_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_6_P22_10_IN;  /**< \brief IfxGtm_TIM3_6_P22_10_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_6_P25_6_IN;  /**< \brief IfxGtm_TIM3_6_P25_6_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_6_P26_0_IN;  /**< \brief IfxGtm_TIM3_6_P26_0_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_6_P32_6_IN;  /**< \brief IfxGtm_TIM3_6_P32_6_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_6_P34_3_IN;  /**< \brief IfxGtm_TIM3_6_P34_3_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_7_P00_8_IN;  /**< \brief IfxGtm_TIM3_7_P00_8_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_7_P02_13_IN;  /**< \brief IfxGtm_TIM3_7_P02_13_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_7_P11_12_IN;  /**< \brief IfxGtm_TIM3_7_P11_12_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_7_P13_15_IN;  /**< \brief IfxGtm_TIM3_7_P13_15_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_7_P13_2_IN;  /**< \brief IfxGtm_TIM3_7_P13_2_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_7_P15_4_IN;  /**< \brief IfxGtm_TIM3_7_P15_4_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_7_P20_11_IN;  /**< \brief IfxGtm_TIM3_7_P20_11_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_7_P20_7_IN;  /**< \brief IfxGtm_TIM3_7_P20_7_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_7_P22_11_IN;  /**< \brief IfxGtm_TIM3_7_P22_11_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_7_P25_7_IN;  /**< \brief IfxGtm_TIM3_7_P25_7_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_7_P32_7_IN;  /**< \brief IfxGtm_TIM3_7_P32_7_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM3_7_P34_4_IN;  /**< \brief IfxGtm_TIM3_7_P34_4_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_0_P00_13_IN;  /**< \brief IfxGtm_TIM4_0_P00_13_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_0_P00_9_IN;  /**< \brief IfxGtm_TIM4_0_P00_9_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_0_P01_12_IN;  /**< \brief IfxGtm_TIM4_0_P01_12_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_0_P02_12_IN;  /**< \brief IfxGtm_TIM4_0_P02_12_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_0_P10_0_IN;  /**< \brief IfxGtm_TIM4_0_P10_0_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_0_P10_8_IN;  /**< \brief IfxGtm_TIM4_0_P10_8_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_0_P11_0_IN;  /**< \brief IfxGtm_TIM4_0_P11_0_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_0_P12_0_IN;  /**< \brief IfxGtm_TIM4_0_P12_0_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_0_P13_12_IN;  /**< \brief IfxGtm_TIM4_0_P13_12_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_0_P21_0_IN;  /**< \brief IfxGtm_TIM4_0_P21_0_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_0_P24_0_IN;  /**< \brief IfxGtm_TIM4_0_P24_0_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_0_P25_8_IN;  /**< \brief IfxGtm_TIM4_0_P25_8_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_0_P30_0_IN;  /**< \brief IfxGtm_TIM4_0_P30_0_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_0_P32_7_IN;  /**< \brief IfxGtm_TIM4_0_P32_7_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_1_P00_10_IN;  /**< \brief IfxGtm_TIM4_1_P00_10_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_1_P00_15_IN;  /**< \brief IfxGtm_TIM4_1_P00_15_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_1_P01_1_IN;  /**< \brief IfxGtm_TIM4_1_P01_1_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_1_P02_15_IN;  /**< \brief IfxGtm_TIM4_1_P02_15_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_1_P10_9_IN;  /**< \brief IfxGtm_TIM4_1_P10_9_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_1_P11_1_IN;  /**< \brief IfxGtm_TIM4_1_P11_1_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_1_P12_1_IN;  /**< \brief IfxGtm_TIM4_1_P12_1_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_1_P15_10_IN;  /**< \brief IfxGtm_TIM4_1_P15_10_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_1_P21_1_IN;  /**< \brief IfxGtm_TIM4_1_P21_1_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_1_P24_1_IN;  /**< \brief IfxGtm_TIM4_1_P24_1_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_1_P25_9_IN;  /**< \brief IfxGtm_TIM4_1_P25_9_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_1_P30_1_IN;  /**< \brief IfxGtm_TIM4_1_P30_1_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_1_P32_5_IN;  /**< \brief IfxGtm_TIM4_1_P32_5_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_2_P00_11_IN;  /**< \brief IfxGtm_TIM4_2_P00_11_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_2_P01_9_IN;  /**< \brief IfxGtm_TIM4_2_P01_9_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_2_P02_13_IN;  /**< \brief IfxGtm_TIM4_2_P02_13_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_2_P02_9_IN;  /**< \brief IfxGtm_TIM4_2_P02_9_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_2_P10_10_IN;  /**< \brief IfxGtm_TIM4_2_P10_10_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_2_P10_6_IN;  /**< \brief IfxGtm_TIM4_2_P10_6_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_2_P11_4_IN;  /**< \brief IfxGtm_TIM4_2_P11_4_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_2_P15_11_IN;  /**< \brief IfxGtm_TIM4_2_P15_11_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_2_P21_6_IN;  /**< \brief IfxGtm_TIM4_2_P21_6_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_2_P23_6_IN;  /**< \brief IfxGtm_TIM4_2_P23_6_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_2_P24_2_IN;  /**< \brief IfxGtm_TIM4_2_P24_2_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_2_P25_10_IN;  /**< \brief IfxGtm_TIM4_2_P25_10_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_2_P30_2_IN;  /**< \brief IfxGtm_TIM4_2_P30_2_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_3_P00_12_IN;  /**< \brief IfxGtm_TIM4_3_P00_12_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_3_P01_13_IN;  /**< \brief IfxGtm_TIM4_3_P01_13_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_3_P02_10_IN;  /**< \brief IfxGtm_TIM4_3_P02_10_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_3_P02_14_IN;  /**< \brief IfxGtm_TIM4_3_P02_14_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_3_P10_14_IN;  /**< \brief IfxGtm_TIM4_3_P10_14_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_3_P10_5_IN;  /**< \brief IfxGtm_TIM4_3_P10_5_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_3_P11_5_IN;  /**< \brief IfxGtm_TIM4_3_P11_5_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_3_P15_12_IN;  /**< \brief IfxGtm_TIM4_3_P15_12_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_3_P21_7_IN;  /**< \brief IfxGtm_TIM4_3_P21_7_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_3_P23_7_IN;  /**< \brief IfxGtm_TIM4_3_P23_7_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_3_P24_3_IN;  /**< \brief IfxGtm_TIM4_3_P24_3_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_3_P25_11_IN;  /**< \brief IfxGtm_TIM4_3_P25_11_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_3_P30_3_IN;  /**< \brief IfxGtm_TIM4_3_P30_3_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_4_P01_0_IN;  /**< \brief IfxGtm_TIM4_4_P01_0_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_4_P01_8_IN;  /**< \brief IfxGtm_TIM4_4_P01_8_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_4_P02_11_IN;  /**< \brief IfxGtm_TIM4_4_P02_11_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_4_P10_13_IN;  /**< \brief IfxGtm_TIM4_4_P10_13_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_4_P10_1_IN;  /**< \brief IfxGtm_TIM4_4_P10_1_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_4_P11_7_IN;  /**< \brief IfxGtm_TIM4_4_P11_7_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_4_P15_13_IN;  /**< \brief IfxGtm_TIM4_4_P15_13_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_4_P20_1_IN;  /**< \brief IfxGtm_TIM4_4_P20_1_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_4_P24_4_IN;  /**< \brief IfxGtm_TIM4_4_P24_4_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_4_P25_12_IN;  /**< \brief IfxGtm_TIM4_4_P25_12_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_4_P30_4_IN;  /**< \brief IfxGtm_TIM4_4_P30_4_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_4_P32_6_IN;  /**< \brief IfxGtm_TIM4_4_P32_6_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_4_P33_10_IN;  /**< \brief IfxGtm_TIM4_4_P33_10_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_4_P33_4_IN;  /**< \brief IfxGtm_TIM4_4_P33_4_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_5_P01_10_IN;  /**< \brief IfxGtm_TIM4_5_P01_10_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_5_P01_2_IN;  /**< \brief IfxGtm_TIM4_5_P01_2_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_5_P01_3_IN;  /**< \brief IfxGtm_TIM4_5_P01_3_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_5_P10_11_IN;  /**< \brief IfxGtm_TIM4_5_P10_11_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_5_P10_2_IN;  /**< \brief IfxGtm_TIM4_5_P10_2_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_5_P11_8_IN;  /**< \brief IfxGtm_TIM4_5_P11_8_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_5_P15_14_IN;  /**< \brief IfxGtm_TIM4_5_P15_14_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_5_P20_3_IN;  /**< \brief IfxGtm_TIM4_5_P20_3_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_5_P24_5_IN;  /**< \brief IfxGtm_TIM4_5_P24_5_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_5_P25_13_IN;  /**< \brief IfxGtm_TIM4_5_P25_13_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_5_P30_5_IN;  /**< \brief IfxGtm_TIM4_5_P30_5_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_5_P33_14_IN;  /**< \brief IfxGtm_TIM4_5_P33_14_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_5_P33_5_IN;  /**< \brief IfxGtm_TIM4_5_P33_5_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_6_P01_14_IN;  /**< \brief IfxGtm_TIM4_6_P01_14_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_6_P01_15_IN;  /**< \brief IfxGtm_TIM4_6_P01_15_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_6_P01_4_IN;  /**< \brief IfxGtm_TIM4_6_P01_4_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_6_P10_15_IN;  /**< \brief IfxGtm_TIM4_6_P10_15_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_6_P10_3_IN;  /**< \brief IfxGtm_TIM4_6_P10_3_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_6_P11_13_IN;  /**< \brief IfxGtm_TIM4_6_P11_13_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_6_P15_15_IN;  /**< \brief IfxGtm_TIM4_6_P15_15_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_6_P24_6_IN;  /**< \brief IfxGtm_TIM4_6_P24_6_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_6_P25_14_IN;  /**< \brief IfxGtm_TIM4_6_P25_14_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_6_P30_6_IN;  /**< \brief IfxGtm_TIM4_6_P30_6_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_6_P33_15_IN;  /**< \brief IfxGtm_TIM4_6_P33_15_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_7_P00_14_IN;  /**< \brief IfxGtm_TIM4_7_P00_14_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_7_P01_11_IN;  /**< \brief IfxGtm_TIM4_7_P01_11_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_7_P10_4_IN;  /**< \brief IfxGtm_TIM4_7_P10_4_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_7_P11_14_IN;  /**< \brief IfxGtm_TIM4_7_P11_14_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_7_P11_15_IN;  /**< \brief IfxGtm_TIM4_7_P11_15_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_7_P13_9_IN;  /**< \brief IfxGtm_TIM4_7_P13_9_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_7_P14_7_IN;  /**< \brief IfxGtm_TIM4_7_P14_7_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_7_P24_7_IN;  /**< \brief IfxGtm_TIM4_7_P24_7_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_7_P25_15_IN;  /**< \brief IfxGtm_TIM4_7_P25_15_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_7_P30_7_IN;  /**< \brief IfxGtm_TIM4_7_P30_7_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM4_7_P34_5_IN;  /**< \brief IfxGtm_TIM4_7_P34_5_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_0_P00_13_IN;  /**< \brief IfxGtm_TIM5_0_P00_13_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_0_P01_12_IN;  /**< \brief IfxGtm_TIM5_0_P01_12_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_0_P01_8_IN;  /**< \brief IfxGtm_TIM5_0_P01_8_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_0_P02_12_IN;  /**< \brief IfxGtm_TIM5_0_P02_12_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_0_P13_11_IN;  /**< \brief IfxGtm_TIM5_0_P13_11_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_0_P22_8_IN;  /**< \brief IfxGtm_TIM5_0_P22_8_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_0_P24_8_IN;  /**< \brief IfxGtm_TIM5_0_P24_8_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_0_P30_8_IN;  /**< \brief IfxGtm_TIM5_0_P30_8_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_0_P31_8_IN;  /**< \brief IfxGtm_TIM5_0_P31_8_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_0_P33_14_IN;  /**< \brief IfxGtm_TIM5_0_P33_14_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_1_P00_15_IN;  /**< \brief IfxGtm_TIM5_1_P00_15_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_1_P01_1_IN;  /**< \brief IfxGtm_TIM5_1_P01_1_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_1_P01_9_IN;  /**< \brief IfxGtm_TIM5_1_P01_9_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_1_P02_15_IN;  /**< \brief IfxGtm_TIM5_1_P02_15_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_1_P13_10_IN;  /**< \brief IfxGtm_TIM5_1_P13_10_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_1_P14_11_IN;  /**< \brief IfxGtm_TIM5_1_P14_11_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_1_P22_9_IN;  /**< \brief IfxGtm_TIM5_1_P22_9_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_1_P24_9_IN;  /**< \brief IfxGtm_TIM5_1_P24_9_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_1_P30_9_IN;  /**< \brief IfxGtm_TIM5_1_P30_9_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_1_P31_9_IN;  /**< \brief IfxGtm_TIM5_1_P31_9_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_1_P33_15_IN;  /**< \brief IfxGtm_TIM5_1_P33_15_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_2_P01_10_IN;  /**< \brief IfxGtm_TIM5_2_P01_10_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_2_P01_9_IN;  /**< \brief IfxGtm_TIM5_2_P01_9_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_2_P02_13_IN;  /**< \brief IfxGtm_TIM5_2_P02_13_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_2_P13_14_IN;  /**< \brief IfxGtm_TIM5_2_P13_14_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_2_P14_14_IN;  /**< \brief IfxGtm_TIM5_2_P14_14_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_2_P22_10_IN;  /**< \brief IfxGtm_TIM5_2_P22_10_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_2_P24_10_IN;  /**< \brief IfxGtm_TIM5_2_P24_10_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_2_P30_10_IN;  /**< \brief IfxGtm_TIM5_2_P30_10_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_2_P31_10_IN;  /**< \brief IfxGtm_TIM5_2_P31_10_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_3_P01_11_IN;  /**< \brief IfxGtm_TIM5_3_P01_11_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_3_P01_13_IN;  /**< \brief IfxGtm_TIM5_3_P01_13_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_3_P01_5_IN;  /**< \brief IfxGtm_TIM5_3_P01_5_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_3_P02_14_IN;  /**< \brief IfxGtm_TIM5_3_P02_14_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_3_P13_4_IN;  /**< \brief IfxGtm_TIM5_3_P13_4_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_3_P14_13_IN;  /**< \brief IfxGtm_TIM5_3_P14_13_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_3_P22_11_IN;  /**< \brief IfxGtm_TIM5_3_P22_11_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_3_P24_11_IN;  /**< \brief IfxGtm_TIM5_3_P24_11_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_3_P30_11_IN;  /**< \brief IfxGtm_TIM5_3_P30_11_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_3_P31_11_IN;  /**< \brief IfxGtm_TIM5_3_P31_11_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_3_P34_1_IN;  /**< \brief IfxGtm_TIM5_3_P34_1_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_4_P00_0_IN;  /**< \brief IfxGtm_TIM5_4_P00_0_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_4_P01_0_IN;  /**< \brief IfxGtm_TIM5_4_P01_0_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_4_P01_8_IN;  /**< \brief IfxGtm_TIM5_4_P01_8_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_4_P13_5_IN;  /**< \brief IfxGtm_TIM5_4_P13_5_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_4_P14_12_IN;  /**< \brief IfxGtm_TIM5_4_P14_12_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_4_P21_2_IN;  /**< \brief IfxGtm_TIM5_4_P21_2_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_4_P24_12_IN;  /**< \brief IfxGtm_TIM5_4_P24_12_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_4_P30_12_IN;  /**< \brief IfxGtm_TIM5_4_P30_12_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_4_P31_12_IN;  /**< \brief IfxGtm_TIM5_4_P31_12_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_4_P34_2_IN;  /**< \brief IfxGtm_TIM5_4_P34_2_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_5_P00_1_IN;  /**< \brief IfxGtm_TIM5_5_P00_1_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_5_P01_10_IN;  /**< \brief IfxGtm_TIM5_5_P01_10_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_5_P01_2_IN;  /**< \brief IfxGtm_TIM5_5_P01_2_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_5_P01_6_IN;  /**< \brief IfxGtm_TIM5_5_P01_6_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_5_P13_13_IN;  /**< \brief IfxGtm_TIM5_5_P13_13_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_5_P13_6_IN;  /**< \brief IfxGtm_TIM5_5_P13_6_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_5_P21_3_IN;  /**< \brief IfxGtm_TIM5_5_P21_3_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_5_P24_13_IN;  /**< \brief IfxGtm_TIM5_5_P24_13_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_5_P30_13_IN;  /**< \brief IfxGtm_TIM5_5_P30_13_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_5_P31_13_IN;  /**< \brief IfxGtm_TIM5_5_P31_13_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_5_P32_5_IN;  /**< \brief IfxGtm_TIM5_5_P32_5_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_5_P34_3_IN;  /**< \brief IfxGtm_TIM5_5_P34_3_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_6_P00_2_IN;  /**< \brief IfxGtm_TIM5_6_P00_2_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_6_P01_14_IN;  /**< \brief IfxGtm_TIM5_6_P01_14_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_6_P01_15_IN;  /**< \brief IfxGtm_TIM5_6_P01_15_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_6_P01_6_IN;  /**< \brief IfxGtm_TIM5_6_P01_6_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_6_P13_7_IN;  /**< \brief IfxGtm_TIM5_6_P13_7_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_6_P14_15_IN;  /**< \brief IfxGtm_TIM5_6_P14_15_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_6_P21_4_IN;  /**< \brief IfxGtm_TIM5_6_P21_4_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_6_P24_14_IN;  /**< \brief IfxGtm_TIM5_6_P24_14_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_6_P30_14_IN;  /**< \brief IfxGtm_TIM5_6_P30_14_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_6_P31_14_IN;  /**< \brief IfxGtm_TIM5_6_P31_14_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_6_P32_6_IN;  /**< \brief IfxGtm_TIM5_6_P32_6_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_6_P34_4_IN;  /**< \brief IfxGtm_TIM5_6_P34_4_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_7_P00_14_IN;  /**< \brief IfxGtm_TIM5_7_P00_14_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_7_P00_3_IN;  /**< \brief IfxGtm_TIM5_7_P00_3_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_7_P01_11_IN;  /**< \brief IfxGtm_TIM5_7_P01_11_IN */
IFX_EXTERN IfxGtm_Tim_TinMap IfxGtm_TIM5_7_P01_7_IN;  /**< \brief IfxGtm_TIM5_7_P01_7_IN */
